{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/ff068bb4-9326-4833-b0d3-8c261d6e2fcc')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/ff068bb4-9326-4833-b0d3-8c261d6e2fcc')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "properties": {
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                    "groupByEntities": [],
                    "groupByAlertDetails": null,
                    "groupByCustomDetails": null
                }
            },
            "queryFrequency": "PT5M",
            "queryPeriod": "PT5M",
            "triggerOperator": "GreaterThan",
            "triggerThreshold": 0,
            "eventGroupingSettings": {
                "aggregationKind": "SingleAlert"
            },
            "severity": "Medium",
            "query": "SecurityEvent \r\n| where EventID == \"4728\" or EventID == \"4732\" or EventID == \"4756\"\r\n| extend HostCustomEntity = Computer\r\n| extend AccountCustomEntity = Account",
            "suppressionDuration": "PT5H",
            "suppressionEnabled": false,
        "tactics": [],
        "displayName": "A member was added to a security-enabled group",
        "enabled": true,
        "description": "A user was added to a local, global, or universal security group",
        "alertRuleTemplateName": null
    },
    "apiVersion": "2021-09-01-preview"
}
]
}
