{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/84fe85e3-91ba-4b5c-be0f-eb9286b1ade7')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/84fe85e3-91ba-4b5c-be0f-eb9286b1ade7')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "properties": {
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                    "groupByEntities": [],
                    "groupByAlertDetails": null,
                    "groupByCustomDetails": null
                }
            },
            "queryFrequency": "PT5M",
            "queryPeriod": "PT5M",
            "triggerOperator": "GreaterThan",
            "triggerThreshold": 0,
            "eventGroupingSettings": {
                "aggregationKind": "SingleAlert"
            },
            "severity": "Medium",
            "query": "SecurityEvent \r\n| where EventID == \"4624\" or EventID == \"4672\"\r\n| where LogonType == 9\r\n| where Account <> \"NT AUTHORITY\\\\SYSTEM\"\r\n| extend AccountCustomEntity = Account\r\n| extend HostCustomEntity = Computer",
            "suppressionDuration": "PT5H",
            "suppressionEnabled": false,
        "tactics": [],
        "displayName": "A user account authenticated using impersonation",
        "enabled": true,
        "description": "Account impersonation has taken place, which may indicate a successful pass-the-hash attempt.",
        "alertRuleTemplateName": null
    },
    "apiVersion": "2021-09-01-preview"
}
]
}
