{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/1a20bf7e-ac86-40d2-a8a4-85bbd53e94a7')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/1a20bf7e-ac86-40d2-a8a4-85bbd53e94a7')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "properties": {
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                    "groupByEntities": [],
                    "groupByAlertDetails": null,
                    "groupByCustomDetails": null
                }
            },
            "queryFrequency": "PT5M",
            "queryPeriod": "PT5M",
            "triggerOperator": "GreaterThan",
            "triggerThreshold": 0,
            "eventGroupingSettings": {
                "aggregationKind": "SingleAlert"
            },
            "severity": "Medium",
            "query": "DeviceRegistryEvents\r\n| where ActionType == \"RegistryValueDeleted\"\r\n| where PreviousRegistryKey has \"AUTOLOGGER_NAME\"\r\n| extend AccountCustomEntity = InitiatingProcessAccountUpn\r\n| extend HostCustomEntity = DeviceName\r\n| extend FileHashCustomEntity = InitiatingProcessMD5",
            "suppressionDuration": "PT5H",
            "suppressionEnabled": false,
            "tactics": [
                "DefenseEvasion"
            ],
            "displayName": "Autologger Provider registry key deletion",
            "enabled": true,
            "description": "An autologger is a trace session that records events from user-mode and kernel-mode trace providers during the boot process. This feature lets you trace the actions of a trace provider while Windows is booting. Attackers will often disable autologger to avoid detection.",
            "alertRuleTemplateName": null
        },
        "apiVersion": "2021-09-01-preview"
    }
]
}
