{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/e0390597-20bf-4cc7-b93a-de5173da1a8b')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/e0390597-20bf-4cc7-b93a-de5173da1a8b')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "properties": {
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                    "groupByEntities": [],
                    "groupByAlertDetails": null,
                    "groupByCustomDetails": null
                }
            },
            "queryFrequency": "PT5M",
            "queryPeriod": "PT5M",
            "triggerOperator": "GreaterThan",
            "triggerThreshold": 0,
            "eventGroupingSettings": {
                "aggregationKind": "SingleAlert"
            },
            "severity": "Medium",
            "query": "SecurityEvent \r\n| where EventID == \"1102\"\r\n| extend HostCustomEntity = Computer",
            "suppressionDuration": "PT5H",
            "suppressionEnabled": false,
            "tactics": [
                "DefenseEvasion"
            ],
            "displayName": "Cleared audit log",
            "enabled": true,
            "description": "Event 1102 is logged whenever the Security log is cleared, REGARDLESS of the status of the Audit System Events audit policy. The Account Name and Domain Name fields identify the user who cleared the log.",
            "alertRuleTemplateName": null
        },
        "apiVersion": "2021-09-01-preview"
    }
]
}
