{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/9b1612b0-9161-408f-a386-b7ebaebab585')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/9b1612b0-9161-408f-a386-b7ebaebab585')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "properties": {
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                    "groupByEntities": [],
                "groupByAlertDetails": [],
            "groupByCustomDetails": []
        }
    },
    "entityMappings": [
        {
            "entityType": "Account",
            "fieldMappings": [
                {
                    "identifier": "FullName",
                    "columnName": "AccountCustomEntity"
                }
            ]
        },
        {
            "entityType": "Host",
            "fieldMappings": [
                {
                    "identifier": "FullName",
                    "columnName": "HostCustomEntity"
                }
            ]
        }
    ],
    "queryFrequency": "PT5M",
    "queryPeriod": "PT5M",
    "triggerOperator": "GreaterThan",
    "triggerThreshold": 0,
    "eventGroupingSettings": {
        "aggregationKind": "SingleAlert"
    },
    "severity": "Medium",
    "query": "DeviceProcessEvents\r\n| where FolderPath == \"C:\\\\Windows\\\\System32\\\\whoami.exe\"\r\n| where InitiatingProcessParentFileName <> \"LTSVC.exe\"\r\n| where InitiatingProcessFileName <> \"LTSVC.exe\"\r\n| where InitiatingProcessParentFileName <> \"PanGpHip.exe\"\r\n| extend HostCustomEntity = DeviceName\r\n| extend AccountCustomEntity = InitiatingProcessAccountName",
    "suppressionDuration": "PT5H",
    "suppressionEnabled": false,
    "tactics": [
        "InitialAccess",
        "Discovery"
    ],
    "displayName": "Commandline Whoami",
    "enabled": true,
    "description": "Whoami is often used by attackers to determine what machine they are logged into",
    "alertRuleTemplateName": null
},
"apiVersion": "2021-09-01-preview"
}
]
}
