{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/e484c8f2-a01a-4da7-a514-1e6f64c8d737')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/e484c8f2-a01a-4da7-a514-1e6f64c8d737')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "properties": {
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "Selected",
                        "groupByEntities": [
                            "IP"
                        ],
                        "groupByAlertDetails": [
                            "DisplayName"
                        ],
                        "groupByCustomDetails": null
                    }
                },
                "customDetails": {
                    "Protocol": "Protocol",
                    "Sensor": "DeviceId"
                },
                "entityMappings": [
                    {
                        "entityType": "IP",
                        "fieldMappings": [
                            {
                                "identifier": "Address",
                                "columnName": "SourceDeviceAddress"
                            }
                        ]
                    },
                    {
                        "entityType": "IP",
                        "fieldMappings": [
                            {
                                "identifier": "Address",
                                "columnName": "DestDeviceAddress"
                            }
                        ]
                    }
                ],
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "(MDIoT) {{AlertName}}",
                    "alertDescriptionFormat": "(MDIoT) {{Description}}",
                    "alertTacticsColumnName": "Tactics",
                    "alertSeverityColumnName": "AlertSeverity"
                },
                "queryFrequency": "PT5M",
                "queryPeriod": "PT5M",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "eventGroupingSettings": {
                    "aggregationKind": "AlertPerResult"
                },
                "severity": "High",
                "query": "SecurityAlert\n| where ProductName == \"Azure Security Center for IoT\"\n| where AlertName == \"Excessive Login Attempts\" \nor AlertName == \"Excessive SMB login attempts\" \nor AlertName == \"Password Guessing Attempt Detected\"\nor AlertName == \"Excessive Number of Sessions\"\n| extend DeviceId = tostring(parse_json(ExtendedProperties).DeviceId)\n| extend SourceDeviceAddress = tostring(parse_json(ExtendedProperties).SourceDeviceAddress)\n| extend DestDeviceAddress = tostring(parse_json(ExtendedProperties).DestinationDeviceAddress)\n| extend RemediationSteps = tostring(parse_json(RemediationSteps)[0])\n| extend Protocol = tostring(parse_json(ExtendedProperties).Protocol)\n| project\n  TimeGenerated,\n  DeviceId,\n  ProductName,\n  ProductComponentName,\n  AlertSeverity,\n  AlertName,\n  Description,\n  Protocol,\n  SourceDeviceAddress,\n  DestDeviceAddress,\n  RemediationSteps,\n  Tactics,\n  AlertLink\n",
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "tactics": [
                    "InitialAccess"
                ],
                "displayName": "Excessive Login Attempts (Microsoft Defender for IoT)",
                "enabled": true,
                "description": "This alert leverages Defender for IoT to detect excessive login attempts that may indicate improper service configuration, human error, or malicious activity on the network such as a cyber threat attempting to manipulate the SCADA network.",
                "alertRuleTemplateName": null
            },
            "apiVersion": "2021-09-01-preview"
        }
    ]
}
