{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/e4848a14-e8ee-4342-b28a-aee50c920bdc')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/e4848a14-e8ee-4342-b28a-aee50c920bdc')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "properties": {
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5M",
                        "matchingMethod": "Selected",
                        "groupByEntities": [
                            "IP"
                        ],
                        "groupByAlertDetails": [
                            "DisplayName"
                        ],
                        "groupByCustomDetails": null
                    }
                },
                "customDetails": {
                    "Protocol": "Protocol",
                    "Sensor": "DeviceId"
                },
                "entityMappings": [
                    {
                        "entityType": "IP",
                        "fieldMappings": [
                            {
                                "identifier": "Address",
                                "columnName": "SourceDeviceAddress"
                            }
                        ]
                    },
                    {
                        "entityType": "IP",
                        "fieldMappings": [
                            {
                                "identifier": "Address",
                                "columnName": "DestDeviceAddress"
                            }
                        ]
                    }
                ],
                "alertDetailsOverride": {
                    "alertDisplayNameFormat": "(MDIoT) {{AlertName}}",
                    "alertDescriptionFormat": "(MDIoT) {{Description}}",
                    "alertTacticsColumnName": "Tactics",
                    "alertSeverityColumnName": "AlertSeverity"
                },
                "queryFrequency": "PT1H",
                "queryPeriod": "PT1H",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "eventGroupingSettings": {
                    "aggregationKind": "AlertPerResult"
                },
                "severity": "Medium",
                "query": "SecurityAlert\n| where AlertName == \"Function Code Not Supported by Outstation\"\nor AlertName == \"Illegal BACNet message\"\nor AlertName == \"Illegal Connection Attempt on Port 0\"\nor AlertName == \"Illegal DNP3 Operation\"\nor AlertName == \"Illegal MODBUS Operation (Exception Raised by Master)\"\nor AlertName == \"Illegal MODBUS Operation (Function Code Zero)\"\nor AlertName == \"Incorrect Parameter Sent to Outstation\"\nor AlertName == \"Initiation of an Obsolete Function Code (Initialize Data)\"\nor AlertName == \"Initiation of an Obsolete Function Code (Save Config)\"\nor AlertName == \"Modbus Exception\"\nor AlertName == \"Unknown Object Sent to Outstation\"\nor AlertName == \"Usage of a Reserved Function Code\"\nor AlertName == \"Usage of Improper Formatting by Outstation\"\nor AlertName == \"Usage of Reserved Status Flags (IIN)\"\nor AlertName == \"Unauthorized communication was detected by a User Defined Protocol Rule\"\nor AlertName == \"Unauthorized Operation was detected by a User Defined whitelist Alert\"\nor AlertName == \"Illegal Protocol Version\"\nor AlertName contains \"Slave Device Received Illegal\"\n| extend DeviceId = tostring(parse_json(ExtendedProperties).DeviceId)\n| extend SourceDeviceAddress = tostring(parse_json(ExtendedProperties).SourceDeviceAddress)\n| extend DestDeviceAddress = tostring(parse_json(ExtendedProperties).DestinationDeviceAddress)\n| extend RemediationSteps = tostring(parse_json(RemediationSteps)[0])\n| extend Protocol = tostring(parse_json(ExtendedProperties).Protocol)\n| project\n  TimeGenerated,\n  DeviceId,\n  ProductName,\n  ProductComponentName,\n  AlertSeverity,\n  AlertName,\n  Description,\n  Protocol,\n  SourceDeviceAddress,\n  DestDeviceAddress,\n  RemediationSteps,\n  Tactics,\n  AlertLink\n",
                "suppressionDuration": "PT1H",
                "suppressionEnabled": false,
                "tactics": [
                    "CommandAndControl"
                ],
                "displayName": "Illegal Function Codes for ICS traffic (Microsoft Defender for IoT)",
                "enabled": true,
                "description": "This alert leverages Defender for IoT to detect Illegal function codes in SCADA equipment indicating improper application configuration or malicious activity such using illegal values within a protocol to exploit a PLC vulnerability.",
                "alertRuleTemplateName": null
            },
            "apiVersion": "2021-09-01-preview"
        }
    ]
}
