{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/00bf4797-ddb8-4f4f-a21e-2b2a96eeb97a')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/00bf4797-ddb8-4f4f-a21e-2b2a96eeb97a')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "properties": {
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                    "groupByEntities": [],
                "groupByAlertDetails": [],
            "groupByCustomDetails": []
        }
    },
    "entityMappings": [
        {
            "entityType": "IP",
            "fieldMappings": [
                {
                    "identifier": "Address",
                    "columnName": "SourceIP"
                }
            ]
        },
        {
            "entityType": "URL",
            "fieldMappings": [
                {
                    "identifier": "Url",
                    "columnName": "MaliciousIP"
                }
            ]
        }
    ],
    "queryFrequency": "PT5H",
    "queryPeriod": "PT5H",
    "triggerOperator": "GreaterThan",
    "triggerThreshold": 0,
    "eventGroupingSettings": {
        "aggregationKind": "SingleAlert"
    },
    "severity": "Informational",
    "query": "union isfuzzy=true\n    (W3CIISLog\n    | extend TrafficDirection = \"InboundOrUnknown\", Country=RemoteIPCountry, Latitude=RemoteIPLatitude, Longitude=RemoteIPLongitude),\n    (DnsEvents\n    | extend TrafficDirection = \"InboundOrUnknown\", Country= RemoteIPCountry, Latitude = RemoteIPLatitude, Longitude = RemoteIPLongitude),\n    (WireData\n    | extend TrafficDirection = iff(Direction != \"Outbound\", \"InboundOrUnknown\", \"Outbound\"), Country=RemoteIPCountry, Latitude=RemoteIPLatitude, Longitude=RemoteIPLongitude),\n    (WindowsFirewall\n    | extend TrafficDirection = iff(CommunicationDirection != \"SEND\", \"InboundOrUnknown\", \"Outbound\"), Country=MaliciousIPCountry, Latitude=MaliciousIPLatitude, Longitude=MaliciousIPLongitude),\n    (CommonSecurityLog\n    | extend TrafficDirection = iff(CommunicationDirection != \"Outbound\", \"InboundOrUnknown\", \"Outbound\"), Country=MaliciousIPCountry, Latitude=MaliciousIPLatitude, Longitude=MaliciousIPLongitude, Confidence=ThreatDescription, Description=ThreatDescription),\n    (VMConnection\n    | where Type == \"VMConnection\"\n    | extend TrafficDirection = iff(Direction != \"outbound\", \"InboundOrUnknown\", \"Outbound\"), Country=RemoteCountry, Latitude=RemoteLatitude, Longitude=RemoteLongitude)\n| where isnotempty(MaliciousIP) and isnotempty(Country) and isnotempty(Latitude) and isnotempty(Longitude)\n",
    "suppressionDuration": "PT5H",
    "suppressionEnabled": false,
    "tactics": [
        "CommandAndControl",
        "InitialAccess"
    ],
    "displayName": "Potential malicious event",
    "enabled": true,
    "description": "This incident has been generated from the query used from the Sentinel overview page where potential malicious events are plotted unto a map.",
    "alertRuleTemplateName": null
},
"apiVersion": "2021-09-01-preview"
}
]
}
