{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/9159a604-2dc7-4fe1-af1d-b52841f6607c')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/9159a604-2dc7-4fe1-af1d-b52841f6607c')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "properties": {
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                    "groupByEntities": [],
                "groupByAlertDetails": [],
            "groupByCustomDetails": []
        }
    },
    "queryFrequency": "P1D",
    "queryPeriod": "P1D",
    "triggerOperator": "GreaterThan",
    "triggerThreshold": 0,
    "eventGroupingSettings": {
        "aggregationKind": "SingleAlert"
    },
    "severity": "Informational",
    "query": "AzureActivity\r\n| where ResourceProviderValue == \"Microsoft.Logic\"\r\n| where ActivityStatus == \"Failed\" or ActivityStatusValue == \"Failed\"\r\n| extend ErrorMessage = tostring(parse_json(tostring(parse_json(tostring(parse_json(Properties).statusMessage)).error)).message)\r\n| project Resource, ResourceGroup, Caller, CallerIpAddress, ActivityStatus, ErrorMessage, ActivitySubstatus\r\n",
    "suppressionDuration": "PT5H",
    "suppressionEnabled": false,
"tactics": [],
"displayName": "Sentinel Playbook Failure",
"enabled": true,
"description": "Query for status of \"Failed\" for all logic apps",
"alertRuleTemplateName": null
},
"apiVersion": "2021-09-01-preview"
}
]
}
