{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/fd70a2d4-75b4-4559-851b-a5a43929ea3c')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/fd70a2d4-75b4-4559-851b-a5a43929ea3c')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "properties": {
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                    "groupByEntities": [],
                "groupByAlertDetails": [],
            "groupByCustomDetails": []
        }
    },
    "entityMappings": [
        {
            "entityType": "Account",
            "fieldMappings": [
                {
                    "identifier": "FullName",
                    "columnName": "AccountCustomEntity"
                }
            ]
        },
        {
            "entityType": "Host",
            "fieldMappings": [
                {
                    "identifier": "FullName",
                    "columnName": "HostCustomEntity"
                }
            ]
        }
    ],
    "queryFrequency": "PT5M",
    "queryPeriod": "PT5M",
    "triggerOperator": "GreaterThan",
    "triggerThreshold": 0,
    "eventGroupingSettings": {
        "aggregationKind": "SingleAlert"
    },
    "severity": "High",
    "query": "(union isfuzzy=true\n(Event\n| where Source == \"Microsoft-Windows-Sysmon\"\n| where EventID in (17,18)\n| extend EvData = parse_xml(EventData)\n| extend EventDetail = EvData.DataItem.EventData.Data\n| extend NamedPipe = EventDetail.[5].[\"#text\"]\n| extend ProcessDetail = EventDetail.[6].[\"#text\"]\n| where NamedPipe contains '583da945-62af-10e8-4902-a8f205c72b2e'\n| extend Account = UserName\n| project-away EventDetail, EvData\n),\n(\n SecurityEvent\n| where EventID == '5145'\n| where AccessList has '%%4418'     // presence of CreatePipeInstance value \n| where RelativeTargetName contains '583da945-62af-10e8-4902-a8f205c72b2e'\n)\n)\n| extend timestamp = TimeGenerated, AccountCustomEntity = Account, HostCustomEntity = Computer",
    "suppressionDuration": "PT5H",
    "suppressionEnabled": false,
    "tactics": [
        "LateralMovement"
    ],
    "displayName": "Solorigate Named Pipe",
    "enabled": true,
    "description": "Identifies a match across various data feeds for named pipe IOCs related to the Solorigate incident.",
    "alertRuleTemplateName": "11b4c19d-2a79-4da3-af38-b067e1273dee"
},
"apiVersion": "2021-09-01-preview"
}
]
}
