{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/2431a6a6-4829-49c4-9bba-98638bd8abdd')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/2431a6a6-4829-49c4-9bba-98638bd8abdd')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "properties": {
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                    "groupByEntities": [],
                "groupByAlertDetails": [],
            "groupByCustomDetails": []
        }
    },
    "entityMappings": [
        {
            "entityType": "Host",
            "fieldMappings": [
                {
                    "identifier": "FullName",
                    "columnName": "HostCustomEntity"
                }
            ]
        }
    ],
    "queryFrequency": "PT5M",
    "queryPeriod": "PT5M",
    "triggerOperator": "GreaterThan",
    "triggerThreshold": 0,
    "eventGroupingSettings": {
        "aggregationKind": "SingleAlert"
    },
    "severity": "Medium",
    "query": "union isfuzzy=true\n(DeviceFileEvents\n| where FolderPath endswith \"vmware-vmdmp.log\"\n| extend HostCustomEntity = DeviceName, timestamp=TimeGenerated),\n(SecurityEvent\n| where EventID == 4663\n| where ObjectName endswith \"vmware-vmdmp.log\"\n| extend HostCustomEntity = Computer, timestamp=TimeGenerated),\n(imFileEvent\n| where TargetFileName endswith \"vmware-vmdmp.log\"\n| extend HostCustomEntity = DvcHostname, timestamp=TimeGenerated\n)",
    "suppressionDuration": "PT5H",
    "suppressionEnabled": false,
    "tactics": [
        "Persistence"
    ],
    "displayName": "SUNSPOT log file creation",
    "enabled": true,
    "description": "This query uses Microsoft Defender for Endpoint data and Windows Event Logs to look for IoCs associated with the SUNSPOT malware shared by Crowdstrike.\nMore details: \n  - https://www.crowdstrike.com/blog/sunspot-malware-technical-analysis/ \n  - https://techcommunity.microsoft.com/t5/azure-sentinel/monitoring-your-software-build-process-with-azure-sentinel/ba-p/2140807",
    "alertRuleTemplateName": "c0e84221-f240-4dd7-ab1e-37e034ea2a4e"
},
"apiVersion": "2021-09-01-preview"
}
]
}
