{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/b2906a61-9a4f-4e6c-8f5d-bc86870988fc')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/b2906a61-9a4f-4e6c-8f5d-bc86870988fc')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "properties": {
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                    "groupByEntities": [],
                "groupByAlertDetails": [],
            "groupByCustomDetails": []
        }
    },
    "queryFrequency": "PT5M",
    "queryPeriod": "PT5M",
    "triggerOperator": "GreaterThan",
    "triggerThreshold": 0,
    "eventGroupingSettings": {
        "aggregationKind": "SingleAlert"
    },
    "severity": "Medium",
    "query": "DeviceNetworkEvents\r\n| where RemotePort == 23\r\n| where InitiatingProcessFileName <> \"advanced_port_scanner.exe\"\r\n| where InitiatingProcessCommandLine !contains \"UnicastScanner\"\r\n| where InitiatingProcessCommandLine <> \"\\\"AuvikAgentService.exe\\\"\"\r\n| extend AccountCustomEntity = InitiatingProcessAccountUpn\r\n| extend HostCustomEntity = DeviceName\r\n| extend IPCustomEntity = RemoteIP\r\n| where InitiatingProcessCommandLine <> \"\\\"WinSCP.exe\\\"\"",
    "suppressionDuration": "PT5H",
    "suppressionEnabled": false,
"tactics": [],
"displayName": "Telnet traffic detected",
"enabled": true,
"description": "Telnet is an insecure protocol. Please investigate this traffic,",
"alertRuleTemplateName": null
},
"apiVersion": "2021-09-01-preview"
}
]
}
